# ShowGrandTotalCount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..ShowGrandTotalCount Property
ScheduleDefinition Class See Also
---
Indicates if the grand total row should display a count of elements in the schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowGrandTotalCount { get; set; }
```

Visual Basic
---
```text
Public Property ShowGrandTotalCount As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowGrandTotalCount {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if an element count should be displayed, false otherwise.
# Remarks
ShowGrandTotalCount can only be enabled if ShowGrandTotal is enabled.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: Display of a grand total row is not enabled. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace